SunCity/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ОсобенностиУчетаНоменклатуры/ОсобенностиУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОсобенностиУчетаНоменклатуры</name>
  <enumValues>
    <name>АлкогольнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>БезОсобенностейУчета</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>КиЗГИСМ</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ЛекарственныеПрепараты</name>
  </enumValues>
  <enumValues>
    <name>ОбувнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияИзНатуральногоМеха</name>
  </enumValues>
  <enumValues>
    <name>ТабачнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Антисептики</name>
  </enumValues>
  <enumValues>
    <name>БАДы</name>
  </enumValues>
  <enumValues>
    <name>НикотиносодержащаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>Пиво</name>
  </enumValues>
  <enumValues>
    <name>СоковаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>БезалкогольноеПиво</name>
  </enumValues>
  <enumValues>
    <name>МорепродуктыПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>МясоПодконтрольноеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ВетеринарныеПрепараты</name>
  </enumValues>
  <enumValues>
    <name>ИгрыИИгрушкиДляДетей</name>
  </enumValues>
  <enumValues>
    <name>РадиоэлектроннаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ТитановаяМеталлопродукция</name>
  </enumValues>
  <enumValues>
    <name>КонсервированнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>РастительныеМасла</name>
  </enumValues>
  <enumValues>
    <name>ОптоволокноИОптоволоконнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ПарфюмерныеИКосметическиеСредстваИБытоваяХимия</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КонсервированнаяПродукцияБезВЕТИС</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Catalogs/ПризнакиПредметовРасчета/ПризнакиПредметовРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПризнакиПредметовРасчета</name>
  <predefined>
    <items>
      <name>ВыигрышАзартнойИгры</name>
      <description>Выигрыш азартной игры</description>
    </items>
    <items>
      <name>ВыигрышЛотереи</name>
      <description>Выигрыш лотереи</description>
    </items>
    <items>
      <name>ИнойПредметРасчета</name>
      <description>Иной предмет расчета</description>
    </items>
    <items>
      <name>ЛотерейныйБилет</name>
      <description>Лотерейный билет</description>
    </items>
    <items>
      <name>Платеж</name>
      <description>Платеж</description>
    </items>
    <items>
      <name>ПодакцизныйТовар</name>
      <description>Подакцизный товар</description>
    </items>
    <items>
      <name>ПодакцизныйТоварМаркируемыйСИИмеющийКМ</name>
      <description>Подакцизный товар, подлежащий маркировке средством идентификации, имеющий код маркировки</description>
    </items>
    <items>
      <name>ПодакцизныйТоварМаркируемыйСИНеИмеющийКМ</name>
      <description>Подакцизный товар, подлежащий маркировке средством идентификации, не имеющий кода маркировки</description>
    </items>
    <items>
      <name>ПредставлениеРИД</name>
      <description>Представление РИД</description>
    </items>
    <items>
      <name>Работа</name>
      <description>Работа</description>
    </items>
    <items>
      <name>СоставнойПредметРасчета</name>
      <description>Составной предмет расчета</description>
    </items>
    <items>
      <name>СтавкаАзартнойИгры</name>
      <description>Ставка азартной игры</description>
    </items>
    <items>
      <name>Товар</name>
      <description>Товар</description>
    </items>
    <items>
      <name>ТоварМаркируемыйСИИмеющийКМ</name>
      <description>Товар, подлежащий маркировке средством идентификации, имеющий код маркировки, за исключением подакцизного товара</description>
    </items>
    <items>
      <name>ТоварМаркируемыйСИНеИмеющийКМ</name>
      <description>Товар, подлежащий маркировке средством идентификации, не имеющий кода маркировки, за исключением подакцизного товара</description>
    </items>
    <items>
      <name>Услуга</name>
      <description>Услуга</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПризнакаПредметаРасчета</name>
    <type>
      <types>EnumRef.ПризнакиПредметаРасчета</types>
    </type>
  </attributes>
</mdclass:Catalog>

SunCity/src/Enums/ТипыНоменклатуры/Forms/ВыборТипаНоменклатуры/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СуффиксыИменЭлементов = Новый Массив;
	
	СуффиксыИменЭлементов.Добавить("Товар");
	СуффиксыИменЭлементов.Добавить("Услуга");
	СуффиксыИменЭлементов.Добавить("ПодарочныйСертификат");
	
	Для Каждого Суффикс из СуффиксыИменЭлементов Цикл
		Элементы["ТипНоменклатуры" + Суффикс].Подсказка = Перечисления.ТипыНоменклатуры.ПодсказкаПоТипуНоменклатуры(
															ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры." + Суффикс));
	КонецЦикла;
		
	ТипНоменклатуры = Параметры.ТипНоменклатуры;
	
	ПризнакПредметаРасчета = Параметры.ПризнакПредметаРасчета;
	
	СвязьОсобенностейУчетаИФО = Перечисления.ОсобенностиУчетаНоменклатуры.СвязьОсобенностейУчетаИФО();
	
	ЕстьОсобенностьПоТоварам = Ложь;
	Для Каждого ЗначениеПеречисления Из Перечисления.ОсобенностиУчетаНоменклатуры Цикл
		
		ОсобенностьВключена = Ложь;
		ИменаФО = СвязьОсобенностейУчетаИФО.Получить(ЗначениеПеречисления);
		
		Если ИменаФО <> Неопределено Тогда
			МассивИменФО = СтрРазделить(ИменаФО, ",");
			Для Каждого СтрМас Из МассивИменФО Цикл
				Если Не ПолучитьФункциональнуюОпцию(СтрМас) Тогда
					ОсобенностьВключена = Ложь;
					Прервать;
				Иначе
					ОсобенностьВключена = Истина;
					ЕстьОсобенностьПоТоварам = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ИмяЗначенияПеречисления = ОбщегоНазначения.ИмяЗначенияПеречисления(ЗначениеПеречисления);
		Если ОсобенностьВключена Тогда
			Элементы["ОсобенностьУчета" + ИмяЗначенияПеречисления].Подсказка =
			Перечисления.ОсобенностиУчетаНоменклатуры.ПодсказкаПоОсобенностиУчетаНоменклатуры(ЗначениеПеречисления);
		Иначе
			Элементы["ОсобенностьУчета" + ИмяЗначенияПеречисления].Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ОсобенностьУчетаБезОсобенностейУчета.Видимость = ЕстьОсобенностьПоТоварам;

	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
		ОсобенностьУчета = Параметры.ОсобенностьУчета;
		ПродаетсяВРозлив = Параметры.ПродаетсяВРозлив;
		Элементы.ГруппаОсобенностиЗначения.Доступность = Истина;
		Элементы.ПродаетсяВРозлив.Доступность = ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция;
		Элементы.ПродаетсяВРозливПиво.Доступность = ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.Пиво;
	Иначе
		ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ПустаяСсылка();
		ПродаетсяВРозлив = Ложь;
		Элементы.ГруппаОсобенностиЗначения.Доступность = Ложь;
		Элементы.ПродаетсяВРозлив.Доступность = Ложь;
		Элементы.ПродаетсяВРозливПиво.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Результат = Новый Структура("ТипНоменклатуры, ОсобенностьУчета, ПродаетсяВРозлив, ПризнакПредметаРасчета");
	Результат.ТипНоменклатуры = ТипНоменклатуры;
	Результат.ПризнакПредметаРасчета = ПризнакПредметаРасчета;
	
	Если ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		Результат.ОсобенностьУчета = ОсобенностьУчета;
	Иначе
		Результат.ОсобенностьУчета = ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета");
	КонецЕсли;
	
	Если Результат.ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция")
		Или Результат.ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.Пиво") Тогда
		Результат.ПродаетсяВРозлив = ПродаетсяВРозлив;
	Иначе
		Результат.ПродаетсяВРозлив = Ложь;
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда
		Закрыть(Результат);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	
	Если ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета");
		Элементы.ГруппаОсобенностиЗначения.Доступность = Истина;
	Иначе
		ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ПустаяСсылка");
		ПродаетсяВРозлив = Ложь;
		Элементы.ГруппаОсобенностиЗначения.Доступность = Ложь;
	КонецЕсли;
	Элементы.ПродаетсяВРозлив.Доступность = Ложь;
	Элементы.ПродаетсяВРозливПиво.Доступность = Ложь;
	
	РасчитатьПризнакПредметаРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобенностьУчетаПриИзменении(Элемент)
	
	ПродаетсяВРозлив = Ложь;
	Если ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция") Тогда
		Элементы.ПродаетсяВРозлив.Доступность = Истина;
	ИначеЕсли ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.Пиво") Тогда
		Элементы.ПродаетсяВРозливПиво.Доступность = Истина;
	Иначе
		Элементы.ПродаетсяВРозлив.Доступность = Ложь ;
	КонецЕсли; 
	
	ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар");
	
	РасчитатьПризнакПредметаРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродаетсяВРозливПивоПриИзменении(Элемент)
	РасчитатьПризнакПредметаРасчета();
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьПризнакПредметаРасчета()
	
	Если ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		
		//ИнтеграцияИСМПТК
        ПризнакПредметаРасчета = ПредопределенноеЗначение("Справочник.ПризнакиПредметовРасчета.Товар");
		Возврат;
		//Конец ИнтеграцияИСМПТК
		
		//Отключенный функционал
		Если ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция") Тогда
			ПризнакПредметаРасчета = ПредопределенноеЗначение("Справочник.ПризнакиПредметовРасчета.ПодакцизныйТоварМаркируемыйСИНеИмеющийКМ");
		ИначеЕсли ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция")
			Или ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.АльтернативныйТабак")
			Или ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.НикотиносодержащаяПродукция") Тогда
			ПризнакПредметаРасчета = ПредопределенноеЗначение("Справочник.ПризнакиПредметовРасчета.ПодакцизныйТоварМаркируемыйСИИмеющийКМ");
		ИначеЕсли ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.Пиво") Тогда
			Если ПродаетсяВРозлив Тогда
				ПризнакПредметаРасчета = ПредопределенноеЗначение("Справочник.ПризнакиПредметовРасчета.ПодакцизныйТоварМаркируемыйСИНеИмеющийКМ");
			Иначе
				ПризнакПредметаРасчета = ПредопределенноеЗначение("Справочник.ПризнакиПредметовРасчета.ПодакцизныйТоварМаркируемыйСИИмеющийКМ");
			КонецЕсли;
		ИначеЕсли ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ПродукцияИзНатуральногоМеха") Тогда
			ПризнакПредметаРасчета = ПредопределенноеЗначение("Справочник.ПризнакиПредметовРасчета.Товар");
		Иначе
			
			ВидыПродукциИСМП = ОбщегоНазначенияИСКлиентСервер.ВидыПродукцииИСМП(Ложь, Истина);
			
			МаркируемаяНеподакцизнаяПродукция = Новый Массив;
			Для Каждого ВидПродукцииИСМП Из ВидыПродукциИСМП Цикл
				ОсобенностьУчетаИСМП = ИнтеграцияИСРТКлиентСервер.ОсобенностьУчетаПоВидуПродукции(ВидПродукцииИСМП, Ложь);
				МаркируемаяНеподакцизнаяПродукция.Добавить(ОсобенностьУчетаИСМП);
			КонецЦикла;
			
			Если МаркируемаяНеподакцизнаяПродукция.Найти(ОсобенностьУчета) = Неопределено Тогда
				ПризнакПредметаРасчета = ПредопределенноеЗначение("Справочник.ПризнакиПредметовРасчета.Товар");
			Иначе
				ПризнакПредметаРасчета = ПредопределенноеЗначение("Справочник.ПризнакиПредметовРасчета.ТоварМаркируемыйСИИмеющийКМ");
			КонецЕсли;
			
		КонецЕсли;
		//Конец Отключенный функционал
	Иначе
		Если ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
			ПризнакПредметаРасчета = ПредопределенноеЗначение("Справочник.ПризнакиПредметовРасчета.Услуга");
		ИначеЕсли ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат") Тогда
			ПризнакПредметаРасчета = ПредопределенноеЗначение("Справочник.ПризнакиПредметовРасчета.Платеж");
		Иначе
			ПризнакПредметаРасчета = ПредопределенноеЗначение("Справочник.ПризнакиПредметовРасчета.Товар");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
